# specify directory to install
cask_args appdir: "/Applications"

# install packages
tap "schniz/tap"
tap "warrensbox/tap"
# tap "ubuntu/microk8s"
# brew "microk8s"
brew "python@3.13"
brew "go@1.24"
brew "git"
brew "jq"
brew "yq"
brew "helm"
brew "kubernetes-cli"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "kind"
brew "tfswitch"
brew "localstack"

# Casks
cask "caffeine"
cask "appcleaner"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "spotify"
cask "folx"
cask "chatgpt"
cask "vlc"