# specify directory to install
cask_args appdir: "/Applications"

# install packages
tap "schniz/tap"
tap "ubuntu/microk8s"
brew "python@3.11"
brew "git"
brew "jq"
brew "yq"
brew "helm"
brew "microk8s"
brew "kubernetes-cli"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
cask "caffeine"
cask "appcleaner"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "spotify"